# 11092022_03

In [1]:
import sys
print(sys.version)
import numpy as np
print(np.__version__)
import pandas as pd
print(pd.__version__)
import matplotlib.pyplot as plt

%matplotlib inline

3.9.12 (main, Apr  5 2022, 01:53:17)
[Clang 12.0.0 ]
1.21.5
1.4.2

In [2]:
np.random.seed(200)
Mice = pd.DataFrame( np.random.geometric(.2, size = (5,5)) , 
             columns = ['test_{}'.format(x) for x in range(5)],
             index = ['mouse_{}'.format(x) for x in range(5)])
Mice

         test_0  test_1  test_2  test_3  test_4
mouse_0      14       2       5       3       7
mouse_1       1       2      11       3      18
mouse_2      10      20      12       2       9
mouse_3       1       7       2       1      13
mouse_4       8       4      10       4       3

In [3]:
Mice.loc['mouse_2', 'test_2']

12

In [4]:
Mice.iloc[2,2]

12

In [8]:
Mice.loc[['mouse_2', 'mouse_4'], 'test_3']

mouse_2    2
mouse_4    4
Name: test_3, dtype: int64

In [9]:
Mice.loc['mouse_2', 'test_1': 'test_3']

test_1    20
test_2    12
test_3     2
Name: mouse_2, dtype: int64

In [10]:
Mice.iloc[1:3, 1:3]

         test_1  test_2
mouse_1       2      11
mouse_2      20      12

In [14]:
Mice.loc[Mice.test_1 > 5,  'test_3': 'test_4']

         test_3  test_4
mouse_2       2       9
mouse_3       1      13

In [15]:
Mice.loc[Mice.test_1 > 5, :]

         test_0  test_1  test_2  test_3  test_4
mouse_2      10      20      12       2       9
mouse_3       1       7       2       1      13

In [16]:
Mice.iloc[:4, :1]

         test_0
mouse_0      14
mouse_1       1
mouse_2      10
mouse_3       1

In [17]:
Mice.iloc[:4, :][Mice.test_0 > 2]

/var/folders/_5/mw87wr4s5p902pvj5xm4sqnw0000gn/T/ipykernel_53473/3654790616.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  Mice.iloc[:4, :][Mice.test_0 > 2]

         test_0  test_1  test_2  test_3  test_4
mouse_0      14       2       5       3       7
mouse_2      10      20      12       2       9

In [18]:
s = pd.Series(range(5), index = range(5,0,-1))

In [19]:
s

5    0
4    1
3    2
2    3
1    4
dtype: int64

In [20]:
s[1]

4

In [21]:
s[1:3]

4    1
3    2
dtype: int64

In [22]:
s.loc[3:1]

3    2
2    3
1    4
dtype: int64

---

# Applying Functions

In [23]:
Mice = pd.DataFrame( np.random.geometric(.2, size = (5,5)),
                   columns = ['test_{}'.format(x) for x in range(5)],
                   index = ['mouse_{}'.format(x) for x in range(5)])
Mice

         test_0  test_1  test_2  test_3  test_4
mouse_0       6       3       5       5       1
mouse_1      16       7       6       2       1
mouse_2       8      17       2       5       2
mouse_3       1       3       5       4       9
mouse_4       1      18       2       2       8

In [24]:
gradebook  = pd.read_csv('gradebook.csv')

In [25]:
gradebook

  student  midterm  final
0     Ben       88     90
1     May       78     87
2     Sue       92     64
3   Blake       56     90
4     Amy       79     96
5   Steve       92     84

In [26]:
gradebook = gradebook.set_index('student')

In [27]:
gradebook

         midterm  final
student
Ben           88     90
May           78     87
Sue           92     64
Blake         56     90
Amy           79     96
Steve         92     84

In [28]:
gradebook.loc['Steve', 'midterm'] = np.nan

In [29]:
gradebook.loc['Amy', 'final'] = np.nan

In [30]:
gradebook

         midterm  final
student
Ben         88.0   90.0
May         78.0   87.0
Sue         92.0   64.0
Blake       56.0   90.0
Amy         79.0    NaN
Steve        NaN   84.0

In [32]:
gradebook.mean()

midterm    78.6
final      83.0
dtype: float64

In [33]:
gradebook.mean(skipna = False)

midterm   NaN
final     NaN
dtype: float64

In [34]:
gradebook.mean(axis=1)

student
Ben      89.0
May      82.5
Sue      78.0
Blake    73.0
Amy      79.0
Steve    84.0
dtype: float64

In [35]:
avg = gradebook.mean()

In [36]:
gradebook-avg

         midterm  final
student
Ben          9.4    7.0
May         -0.6    4.0
Sue         13.4  -19.0
Blake      -22.6    7.0
Amy          0.4    NaN
Steve        NaN    1.0

In [37]:
gradebook

         midterm  final
student
Ben         88.0   90.0
May         78.0   87.0
Sue         92.0   64.0
Blake       56.0   90.0
Amy         79.0    NaN
Steve        NaN   84.0

In [42]:
g_range = lambda x : x.max() -x.min()

In [43]:
g_range

In [44]:
gradebook.apply(g_range)

midterm    36.0
final      26.0
dtype: float64

In [45]:
gradebook.apply(g_range, axis = 1)

student
Ben       2.0
May       9.0
Sue      28.0
Blake    34.0
Amy       0.0
Steve     0.0
dtype: float64

---

# Aggregate

In [46]:
gradebook.agg(g_range)

midterm    36.0
final      26.0
dtype: float64

In [47]:
def g_min_max(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [48]:
gradebook.apply(g_min_max)

     midterm  final
min     56.0   64.0
max     92.0   90.0

In [50]:
gradebook.applymap(lambda x : x + 100)

         midterm  final
student
Ben        188.0  190.0
May        178.0  187.0
Sue        192.0  164.0
Blake      156.0  190.0
Amy        179.0    NaN
Steve        NaN  184.0

In [51]:
gradebook

         midterm  final
student
Ben         88.0   90.0
May         78.0   87.0
Sue         92.0   64.0
Blake       56.0   90.0
Amy         79.0    NaN
Steve        NaN   84.0

In [52]:
gradebook.describe()

         midterm      final
count   5.000000   5.000000
mean   78.600000  83.000000
std    13.957077  10.908712
min    56.000000  64.000000
25%    78.000000  84.000000
50%    79.000000  87.000000
75%    88.000000  90.000000
max    92.000000  90.000000

In [53]:
gradebook.mean(axis=1)

student
Ben      89.0
May      82.5
Sue      78.0
Blake    73.0
Amy      79.0
Steve    84.0
dtype: float64

In [54]:
pd.cut(gradebook.mean(axis = 1),(0, 70, 80, 90, 100), labels =("F", "C", "B", "A"))

student
Ben      B
May      B
Sue      C
Blake    C
Amy      C
Steve    B
dtype: category
Categories (4, object): ['F' < 'C' < 'B' < 'A']

In [55]:
gradebook['letter_grade'] = pd.cut(gradebook.mean(axis = 1),(0, 70, 80, 90, 100), labels =("F", "C", "B", "A"))

In [56]:
gradebook

         midterm  final letter_grade
student
Ben         88.0   90.0            B
May         78.0   87.0            B
Sue         92.0   64.0            C
Blake       56.0   90.0            C
Amy         79.0    NaN            C
Steve        NaN   84.0            B

In [58]:
gradebook.letter_grade.describe()

count     6
unique    2
top       C
freq      3
Name: letter_grade, dtype: object

In [59]:
gradebook['letter_grade']

student
Ben      B
May      B
Sue      C
Blake    C
Amy      C
Steve    B
Name: letter_grade, dtype: category
Categories (4, object): ['F' < 'C' < 'B' < 'A']

In [60]:
gradebook.letter_grade

student
Ben      B
May      B
Sue      C
Blake    C
Amy      C
Steve    B
Name: letter_grade, dtype: category
Categories (4, object): ['F' < 'C' < 'B' < 'A']

In [61]:
gradebook.letter_grade.value_counts()

C    3
B    3
F    0
A    0
Name: letter_grade, dtype: int64

In [71]:
gradebook.to_csv('gradebook_v5.csv')

---

In [72]:
gradebook = pd.read_csv('gradedbook_v3.csv')

In [73]:
gradebook

     student  midterm  final letter_grade
0        Ben     88.0   90.0            B
1        May     78.0   87.0            B
2        Sue     92.0   64.0            C
3      Blake     56.0   90.0            C
4        Amy     79.0    NaN            C
5      Steve      NaN   84.0            B
6       Anna     88.0   90.0            B
7        Bob     12.0   25.0            F
8      Chris     40.0   80.0            C
9       Paul     98.0   94.0            A
10  Samantha     92.0   88.0            B

In [74]:
gradebook.midterm.mean()

72.3

In [75]:
gradebook['midterm'].mean()

72.3

In [78]:
gr1 = gradebook['letter_grade'] != 'F'

In [79]:
gr1

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7     False
8      True
9      True
10     True
Name: letter_grade, dtype: bool

In [84]:
gradebook[gradebook['letter_grade'] != 'F'].mean()

/var/folders/_5/mw87wr4s5p902pvj5xm4sqnw0000gn/T/ipykernel_53473/955110452.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  gradebook[gradebook['letter_grade'] != 'F'].mean()

midterm    79.000000
final      85.222222
dtype: float64

In [86]:
gradebook[gradebook['letter_grade']!='F']

     student  midterm  final letter_grade
0        Ben     88.0   90.0            B
1        May     78.0   87.0            B
2        Sue     92.0   64.0            C
3      Blake     56.0   90.0            C
4        Amy     79.0    NaN            C
5      Steve      NaN   84.0            B
6       Anna     88.0   90.0            B
8      Chris     40.0   80.0            C
9       Paul     98.0   94.0            A
10  Samantha     92.0   88.0            B

In [87]:
gradebook['letter_grade']!='F'

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7     False
8      True
9      True
10     True
Name: letter_grade, dtype: bool

avg = gradebook[gradebook['letter_grade']!='F'].mean(axis = 0)

In [90]:
avg

midterm    78.6
final      83.0
dtype: float64

In [91]:
gradebook.midterm

0     88.0
1     78.0
2     92.0
3     56.0
4     79.0
5      NaN
6     88.0
7     12.0
8     40.0
9     98.0
10    92.0
Name: midterm, dtype: float64

In [96]:
gradebook[gradebook['letter_grade'] != 'F'].midterm.std()

19.078784028338912

In [97]:
gradebook[gradebook['letter_grade'] != 'F'].final.count()

9

In [101]:
gradebook[gradebook['letter_grade'] == 'C']

  student  midterm  final letter_grade
2     Sue     92.0   64.0            C
3   Blake     56.0   90.0            C
4     Amy     79.0    NaN            C
8   Chris     40.0   80.0            C

In [102]:
gradebook['midterm_curved'] = gradebook[gradebook['letter_grade'] == 'C'].final

In [103]:
gradebook

     student  midterm  final letter_grade  midterm_curved
0        Ben     88.0   90.0            B             NaN
1        May     78.0   87.0            B             NaN
2        Sue     92.0   64.0            C            64.0
3      Blake     56.0   90.0            C            90.0
4        Amy     79.0    NaN            C             NaN
5      Steve      NaN   84.0            B             NaN
6       Anna     88.0   90.0            B             NaN
7        Bob     12.0   25.0            F             NaN
8      Chris     40.0   80.0            C            80.0
9       Paul     98.0   94.0            A             NaN
10  Samantha     92.0   88.0            B             NaN

In [100]:
gradebook[gradebook['letter_grade'] == 'C']

  student  midterm  final letter_grade
2     Sue     92.0   64.0            C
3   Blake     56.0   90.0            C
4     Amy     79.0    NaN            C
8   Chris     40.0   80.0            C

In [104]:
gradebook['midterm_curved'] = gradebook.apply(lambda x : x.midterm + 10, axis = 1)

In [105]:
gradebook

     student  midterm  final letter_grade  midterm_curved
0        Ben     88.0   90.0            B            98.0
1        May     78.0   87.0            B            88.0
2        Sue     92.0   64.0            C           102.0
3      Blake     56.0   90.0            C            66.0
4        Amy     79.0    NaN            C            89.0
5      Steve      NaN   84.0            B             NaN
6       Anna     88.0   90.0            B            98.0
7        Bob     12.0   25.0            F            22.0
8      Chris     40.0   80.0            C            50.0
9       Paul     98.0   94.0            A           108.0
10  Samantha     92.0   88.0            B           102.0

In [106]:
gradebook['avg_exam'] = gradebook.apply(lambda x : (x.midterm + x.final)/2, axis =1)

In [107]:
gradebook

     student  midterm  final letter_grade  midterm_curved  avg_exam
0        Ben     88.0   90.0            B            98.0      89.0
1        May     78.0   87.0            B            88.0      82.5
2        Sue     92.0   64.0            C           102.0      78.0
3      Blake     56.0   90.0            C            66.0      73.0
4        Amy     79.0    NaN            C            89.0       NaN
5      Steve      NaN   84.0            B             NaN       NaN
6       Anna     88.0   90.0            B            98.0      89.0
7        Bob     12.0   25.0            F            22.0      18.5
8      Chris     40.0   80.0            C            50.0      60.0
9       Paul     98.0   94.0            A           108.0      96.0
10  Samantha     92.0   88.0            B           102.0      90.0

In [108]:
 gradebook['avg_exam'].value_counts()

89.0    2
82.5    1
78.0    1
73.0    1
18.5    1
60.0    1
96.0    1
90.0    1
Name: avg_exam, dtype: int64

---

---

In [109]:
gradebook = pd.read_csv('gradebook_v2.csv')

In [110]:
gradebook

  student  midterm  final letter_grade
0     Ben     88.0   90.0            B
1     May     78.0   87.0            B
2     Sue     92.0   64.0            C
3   Blake     56.0   90.0            C
4     Amy     79.0    NaN            C
5   Steve      NaN   84.0            B

In [111]:
gradebook.index = gradebook['student']

In [112]:
gradebook

        student  midterm  final letter_grade
student
Ben         Ben     88.0   90.0            B
May         May     78.0   87.0            B
Sue         Sue     92.0   64.0            C
Blake     Blake     56.0   90.0            C
Amy         Amy     79.0    NaN            C
Steve     Steve      NaN   84.0            B

In [113]:
gradebook = pd.read_csv('gradebook_v2.csv')

In [114]:
gradebook

  student  midterm  final letter_grade
0     Ben     88.0   90.0            B
1     May     78.0   87.0            B
2     Sue     92.0   64.0            C
3   Blake     56.0   90.0            C
4     Amy     79.0    NaN            C
5   Steve      NaN   84.0            B

In [115]:
gradebook = pd.read_csv('gradebook_v2.csv', index_col = 0)

In [116]:
gradebook

         midterm  final letter_grade
student
Ben         88.0   90.0            B
May         78.0   87.0            B
Sue         92.0   64.0            C
Blake       56.0   90.0            C
Amy         79.0    NaN            C
Steve        NaN   84.0            B

In [117]:
gradebook.sort_index()

         midterm  final letter_grade
student
Amy         79.0    NaN            C
Ben         88.0   90.0            B
Blake       56.0   90.0            C
May         78.0   87.0            B
Steve        NaN   84.0            B
Sue         92.0   64.0            C

In [118]:
gradebook.sort['final']

AttributeError: 'DataFrame' object has no attribute 'sort'

In [119]:
gradebook = gradebook.sort_index()

In [120]:
gradebook

         midterm  final letter_grade
student
Amy         79.0    NaN            C
Ben         88.0   90.0            B
Blake       56.0   90.0            C
May         78.0   87.0            B
Steve        NaN   84.0            B
Sue         92.0   64.0            C

In [121]:
gradebook.sort_values('midterm')

         midterm  final letter_grade
student
Blake       56.0   90.0            C
May         78.0   87.0            B
Amy         79.0    NaN            C
Ben         88.0   90.0            B
Sue         92.0   64.0            C
Steve        NaN   84.0            B

In [123]:
gradebook.sort_values('midterm', ascending = False)

         midterm  final letter_grade
student
Sue         92.0   64.0            C
Ben         88.0   90.0            B
Amy         79.0    NaN            C
May         78.0   87.0            B
Blake       56.0   90.0            C
Steve        NaN   84.0            B

In [124]:
gradebook.sort_values(['final', 'midterm'], ascending = False)

         midterm  final letter_grade
student
Ben         88.0   90.0            B
Blake       56.0   90.0            C
May         78.0   87.0            B
Steve        NaN   84.0            B
Sue         92.0   64.0            C
Amy         79.0    NaN            C